In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [5]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [6]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [7]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [8]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
float_data = pd.Series([1,2,None], dtype='float64')

In [10]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [11]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [12]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [13]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = np.nan

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.standard_normal((7,3)))

In [23]:
df.iloc[:4, 1] = np.nan

In [24]:
df.iloc[:2,2] = np.nan

In [25]:
df

          0         1         2
0  2.656366       NaN       NaN
1  1.110995       NaN       NaN
2  0.113155       NaN  1.610229
3  1.509491       NaN  0.286866
4 -0.024227 -0.965079 -0.007792
5 -1.086936  0.023540 -1.600528
6  0.389036 -1.439516 -0.246199

In [26]:
df.dropna()

          0         1         2
4 -0.024227 -0.965079 -0.007792
5 -1.086936  0.023540 -1.600528
6  0.389036 -1.439516 -0.246199

In [27]:
df.dropna(thresh=2)

          0         1         2
2  0.113155       NaN  1.610229
3  1.509491       NaN  0.286866
4 -0.024227 -0.965079 -0.007792
5 -1.086936  0.023540 -1.600528
6  0.389036 -1.439516 -0.246199

In [28]:
df.fillna(0)

          0         1         2
0  2.656366  0.000000  0.000000
1  1.110995  0.000000  0.000000
2  0.113155  0.000000  1.610229
3  1.509491  0.000000  0.286866
4 -0.024227 -0.965079 -0.007792
5 -1.086936  0.023540 -1.600528
6  0.389036 -1.439516 -0.246199

In [29]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  2.656366  0.500000  0.000000
1  1.110995  0.500000  0.000000
2  0.113155  0.500000  1.610229
3  1.509491  0.500000  0.286866
4 -0.024227 -0.965079 -0.007792
5 -1.086936  0.023540 -1.600528
6  0.389036 -1.439516 -0.246199

In [30]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

df.iloc[2:, 1] = np.nan

df.iloc[4:, 2] = np.nan

In [31]:
df

          0         1         2
0  0.300457  0.285723 -0.077086
1 -1.869208  0.276068  0.613477
2 -0.367473       NaN  0.370146
3  0.701851       NaN  0.417576
4  0.943371       NaN       NaN
5  0.975670       NaN       NaN

In [32]:
df.fillna(method="ffill")

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_10936\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.300457  0.285723 -0.077086
1 -1.869208  0.276068  0.613477
2 -0.367473  0.276068  0.370146
3  0.701851  0.276068  0.417576
4  0.943371  0.276068  0.417576
5  0.975670  0.276068  0.417576

In [33]:
df.fillna(method="ffill", limit=2)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_10936\1627181726.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0  0.300457  0.285723 -0.077086
1 -1.869208  0.276068  0.613477
2 -0.367473  0.276068  0.370146
3  0.701851  0.276068  0.417576
4  0.943371       NaN  0.417576
5  0.975670       NaN  0.417576

In [34]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                                  "pastrami", "corned beef", "bacon",
                                  "pastrami", "honey ham", "nova lox"],
                         "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [38]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [39]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [40]:
data["animal"] = data["food"].map(meat_to_animal)

In [41]:
def get_animal(x):
    return meat_to_animal[x]

In [42]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [43]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [45]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
data.replace({-999: np.nan, -1000: 0}) #Dictionary way to do this

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                        index=["Ohio", "Colorado", "New York"],
                        columns=["one", "two", "three", "four"])

In [51]:
def transform(x):
    return x[:4].upper()

In [52]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [55]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [56]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [57]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [58]:
bins = [18, 25, 35, 60, 100]

In [59]:
age_categories = pd.cut(ages, bins)

In [60]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [63]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [64]:
data = np.random.uniform(size=20)

In [65]:
pd.cut(data, 4, precision=2)

[(0.14, 0.35], (0.14, 0.35], (0.14, 0.35], (0.35, 0.56], (0.56, 0.77], ..., (0.35, 0.56], (0.14, 0.35], (0.35, 0.56], (0.77, 0.98], (0.56, 0.77]]
Length: 20
Categories (4, interval[float64, right]): [(0.14, 0.35] < (0.35, 0.56] < (0.56, 0.77] < (0.77, 0.98]]

In [66]:
data = np.random.standard_normal(1000)

In [67]:
quartiles = pd.qcut(data, 4, precision=2)

In [68]:
quartiles

[(-0.017, 0.61], (-3.0399999999999996, -0.72], (0.61, 2.62], (-0.72, -0.017], (-3.0399999999999996, -0.72], ..., (-3.0399999999999996, -0.72], (-3.0399999999999996, -0.72], (-0.72, -0.017], (-3.0399999999999996, -0.72], (-3.0399999999999996, -0.72]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0399999999999996, -0.72] < (-0.72, -0.017] < (-0.017, 0.61] < (0.61, 2.62]]

In [69]:
pd.value_counts(quartiles)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_10936\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.0399999999999996, -0.72]    250
(-0.72, -0.017]                 250
(-0.017, 0.61]                  250
(0.61, 2.62]                    250
Name: count, dtype: int64

In [70]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [71]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008542    -0.011865     0.047177     0.033408
std       0.985126     1.023091     0.989459     0.960350
min      -2.955805    -3.147461    -3.605483    -2.974365
25%      -0.711530    -0.707190    -0.603048    -0.608718
50%       0.022085    -0.018010     0.060241     0.031476
75%       0.636701     0.717631     0.710153     0.704812
max       3.202520     4.142995     3.664417     3.043920

In [72]:
col = data[2]

In [73]:
col[col.abs() > 3]

309   -3.605483
311    3.664417
789   -3.281413
999    3.058289
Name: 2, dtype: float64

In [74]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
309  0.458477 -0.241413 -3.605483 -0.779812
311 -1.053194  0.322689  3.664417 -1.395962
388 -1.294224  4.142995 -0.200638  2.025715
502  0.269760 -3.124367 -0.930006  1.059453
557 -1.705182 -3.147461  1.175611 -0.161487
780 -0.137814  3.362852 -0.649794 -0.105418
789 -1.543796 -0.411411 -3.281413 -0.517990
865  3.202520 -1.418176 -0.734047 -0.286701
928 -0.057549 -0.614202  0.604505  3.043920
999 -1.279795  0.188555  3.058289  0.012632

In [75]:
data[data.abs() > 3] = np.sign(data) *3

In [76]:
data.describe

<bound method NDFrame.describe of             0         1         2         3
0   -0.088703  0.793489 -1.335928  0.488279
1    1.126276  0.233758  1.122306  0.821517
2    0.163419  1.112070  0.387032 -0.394426
3    0.978887  2.733023 -0.192744 -1.382961
4    2.595633  0.219185 -0.735587 -0.532819
..        ...       ...       ...       ...
995 -0.804844 -1.077563 -1.254444  0.666918
996  0.520033  0.710850  1.315590  0.340495
997 -0.905471 -1.211804 -0.387640 -0.625924
998  0.607466  0.851094 -0.470325 -1.050624
999 -1.279795  0.188555  3.000000  0.012632

[1000 rows x 4 columns]>

In [77]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008744    -0.013099     0.047341     0.033364
std       0.984486     1.017119     0.984101     0.960213
min      -2.955805    -3.000000    -3.000000    -2.974365
25%      -0.711530    -0.707190    -0.603048    -0.608718
50%       0.022085    -0.018010     0.060241     0.031476
75%       0.636701     0.717631     0.710153     0.704812
max       3.000000     3.000000     3.000000     3.000000

In [78]:
np.sign(data)

       0    1    2    3
0   -1.0  1.0 -1.0  1.0
1    1.0  1.0  1.0  1.0
2    1.0  1.0  1.0 -1.0
3    1.0  1.0 -1.0 -1.0
4    1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...
995 -1.0 -1.0 -1.0  1.0
996  1.0  1.0  1.0  1.0
997 -1.0 -1.0 -1.0 -1.0
998  1.0  1.0 -1.0 -1.0
999 -1.0  1.0  1.0  1.0

[1000 rows x 4 columns]

In [79]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))

In [80]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [81]:
sampler = np.random.permutation(5)

In [83]:
sampler

array([0, 4, 1, 2, 3])

In [82]:
df.take(sampler)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27

In [84]:
df.iloc[sampler]

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27

In [85]:
column_sampler = np.random.permutation(7)

In [86]:
column_sampler

array([2, 5, 1, 4, 0, 6, 3])

In [87]:
df.take(column_sampler, axis = "columns")

    2   5   1   4   0   6   3
0   2   5   1   4   0   6   3
1   9  12   8  11   7  13  10
2  16  19  15  18  14  20  17
3  23  26  22  25  21  27  24
4  30  33  29  32  28  34  31

In [88]:
df.sample(n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27

In [89]:
choices = pd.Series([5,7,-1,6,4])

In [90]:
choices.sample(n=10, replace=True)

0    5
3    6
2   -1
1    7
2   -1
2   -1
1    7
4    4
3    6
0    5
dtype: int64

In [91]:
df = pd.DataFrame({"key":["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

In [92]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [93]:
pd.get_dummies(df["key"], dtype = float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [94]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [95]:
df_with_dummy = df[["data1"]].join(dummies)

In [96]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [97]:
mnames = ["movie_id", "title", "genres"]

In [100]:
movies = pd.read_table("textbook/datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")

In [102]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [103]:
dummies = movies["genres"].str.get_dummies("|")

In [104]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [105]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [106]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [107]:
np.random.seed(12345)

In [108]:
values = np.random.uniform(size=10)

In [109]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [110]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [111]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [112]:
val = "a,b,  guido"

In [113]:
val.split(",")

['a', 'b', '  guido']

In [114]:
pieces = [x.strip() for x in val.split(",")]

In [115]:
first, second, third = pieces

In [116]:
first + "::" + second + "::" + third

'a::b::guido'

In [117]:
"::".join(pieces)

'a::b::guido'

In [118]:
"guido" in val

True

In [119]:
val.index(",")

1

In [120]:
val.find(":")

-1

In [121]:
import re

In [122]:
text = "foo    bar\t baz  \tqux"

In [123]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [124]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [125]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [126]:
m = regex.search(text)

In [127]:
m

In [128]:
text[m.start():m.end()]

'dave@google.com'

In [129]:
print(regex.match(text))

None

In [131]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [132]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
            "Rob": "rob@gmail.com", "Wes": np.nan}

In [133]:
data = pd.Series(data)

In [134]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [135]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [136]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [137]:
data_as_string_ext = data.astype('string')

In [138]:
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [139]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [140]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [141]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [142]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [143]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [144]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [146]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [147]:
values = pd.Series(['apple', 'orange', 'apple',
                        'apple'] * 2)

In [148]:
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [150]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [151]:
pd.value_counts(values)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_10936\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [152]:
values = pd.Series([0, 1, 0, 0] * 2)

In [153]:
dim = pd.Series(['apple', 'orange'])

In [154]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [155]:
dim

0     apple
1    orange
dtype: object

In [157]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [158]:
values = pd.Series([0, 1, 0, 0] * 2)

In [161]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)

In [162]:
rng = np.random.default_rng(seed=12345)

In [163]:
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size = N),
                   'weight': rng.uniform(0, 4, size = N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])

In [164]:
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [165]:
fruit_cat = df['fruit'].astype('category')

In [166]:
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [167]:
c = fruit_cat.array

In [168]:
type(c)

pandas.core.arrays.categorical.Categorical

In [169]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [170]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [171]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [172]:
df['fruit'] = df['fruit'].astype('category')

In [173]:
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [174]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

In [176]:
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [177]:
categories = ['foo', 'bar', 'baz']

In [178]:
codes = [0, 1, 2, 0, 0, 1]

In [179]:
my_cats_2 = pd.Categorical.from_codes(codes, categories)

In [180]:
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [181]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                            ordered=True)

In [182]:
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [183]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [184]:
rng = np.random.default_rng(seed=12345)

In [185]:
draws = rng.standard_normal(1000)

In [186]:
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [187]:
bins = pd.qcut(draws, 4)

In [188]:
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [189]:
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [190]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [191]:
bins = pd.Series(bins, name='quartile')

In [192]:
results = (pd.Series(draws)
               .groupby(bins)
               .agg(['count', 'min', 'max'])
               .reset_index())

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_10936\1766305315.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

In [193]:
results

           quartile  count       min       max
0  (-3.121, -0.675]    250 -3.119609 -0.678494
1  (-0.675, 0.0134]    250 -0.673305  0.008009
2   (0.0134, 0.687]    250  0.018753  0.686183
3    (0.687, 3.211]    250  0.688282  3.211418

In [194]:
N = 10_000_00

In [195]:
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [196]:
categories = labels.astype('category')

In [197]:
%time _ = labels.astype('category')

CPU times: total: 46.9 ms
Wall time: 41 ms

In [198]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [199]:
cat_s = s.astype('category')

In [200]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [201]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [202]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [203]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

In [204]:
cat_s2 = cat_s.cat.set_categories(actual_categories)

In [205]:
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [206]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [207]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [210]:
data=pd.Series(np.random.uniform(size=9),
          index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                 [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [211]:
data

a  1    0.723685
   2    0.642475
   3    0.717454
b  1    0.467599
   3    0.325585
c  1    0.439645
   2    0.729689
d  2    0.994015
   3    0.676874
dtype: float64

In [212]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [214]:
data["b"]

1    0.467599
3    0.325585
dtype: float64

In [215]:
data["b":"c"]

b  1    0.467599
   3    0.325585
c  1    0.439645
   2    0.729689
dtype: float64

In [216]:
data.loc[["b","d"]]

b  1    0.467599
   3    0.325585
d  2    0.994015
   3    0.676874
dtype: float64

In [217]:
data[:, 2]

a    0.642475
c    0.729689
d    0.994015
dtype: float64

In [218]:
data.unstack()

          1         2         3
a  0.723685  0.642475  0.717454
b  0.467599       NaN  0.325585
c  0.439645  0.729689       NaN
d       NaN  0.994015  0.676874

In [219]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                         index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                         columns=[["Ohio", "Ohio", "Colorado"],
                                  ["Green", "Red", "Green"]])

In [221]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [222]:
frame.index.names = ["key1", "key2"]

frame.columns.names = ["state", "color"]

In [223]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [224]:
frame.index.nlevels

2

In [225]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [226]:
pd.MultiIndex.from_arrays([["Ohio", "Ohio", "Colorado"],
                          ["Green", "Red", "Green"]],
                          names=["state", "color"])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [227]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [228]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [229]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [230]:
frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [231]:
frame.groupby(level="color", axis="columns").sum()

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_10936\775557097.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(level="color", axis="columns").sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [232]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                          "c": ["one", "one", "one", "two", "two",
                                "two", "two"],
                          "d": [0, 1, 2, 0, 1, 2, 3]})

In [233]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [238]:
frame2 = frame.set_index(["c", "d"])

In [235]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [239]:
frame.set_index(["c", "d"], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [240]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [241]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                        "data1": pd.Series(range(7), dtype="Int64")})

In [242]:
df2 = pd.DataFrame({"key": ["a", "b", "d"],
                        "data2": pd.Series(range(3), dtype="Int64")})

In [243]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [244]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [245]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [246]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [248]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                        "data1": pd.Series(range(7), dtype="Int64")})

df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
                        "data2": pd.Series(range(3), dtype="Int64")})

In [249]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [250]:
pd.merge(df1, df2, how="outer")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [251]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey", how="outer")

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [252]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                        "data1": pd.Series(range(6), dtype="Int64")})

In [253]:
df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"],
                        "data2": pd.Series(range(5), dtype="Int64")})

In [254]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [255]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [256]:
pd.merge(df1, df2, on="key", how="left")

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3